БухЭксп/InformationRegisters/CW_ТекущийЭтапСогласованияОбъекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ТекущийЭтапСогласованияОбъекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЭтапСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ЭтапыСогласования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСогласования</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ОбъектыСогласования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ТекущийЭтапСогласованияОбъекта/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Функция - Получить текущий этап согласования объекта
//
// Параметры:
//  ОбъектСогласования	 - 	ссылка на объъект согласования 
// 
// Возвращаемое значение:
//   - этап согласования
//
Функция ПолучитьТекущийЭтапСогласованияОбъекта(ОбъектСогласования) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ТекущийЭтапСогласованияОбъекта.ОбъектСогласования КАК ОбъектСогласования,
	               |	CW_ТекущийЭтапСогласованияОбъекта.ЭтапСогласования КАК ЭтапСогласования
	               |ИЗ
	               |	РегистрСведений.CW_ТекущийЭтапСогласованияОбъекта КАК CW_ТекущийЭтапСогласованияОбъекта
	               |ГДЕ
	               |	CW_ТекущийЭтапСогласованияОбъекта.ОбъектСогласования = &ОбъектСогласования";
	
	Запрос.УстановитьПараметр("ОбъектСогласования", ОбъектСогласования);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЭтапСогласования;
	КонецЕсли;
	
	Возврат Неопределено;
	
	
КонецФункции

Процедура ЗаписатьТекущийЭтапСогласованияОбъекта(ОбъектСогласования, ЭтапСогласования) Экспорт
	
	//Запись в регистр
	Запись = РегистрыСведений.CW_ТекущийЭтапСогласованияОбъекта.СоздатьМенеджерЗаписи();
	Запись.ОбъектСогласования	= ОбъектСогласования;
	Запись.Прочитать();
	
	Запись.ОбъектСогласования 	= ОбъектСогласования;
	Запись.ЭтапСогласования		= ЭтапСогласования;
	Запись.Записать(Истина);

КонецПроцедуры     
#КонецЕсли
